<h1>Практическая № 2 по теме: Условия.</h1>
<h2>Задание 1</h2>
<?php
$a=15;
$b=2;
echo "a = $a и b = $b";
if ($a>$b){
    echo "Сумма а+b=".($a+$b);
}else{
    echo "Произведение a*b= ".($a*$b);
}
?>

<h2>Задание 2</h2>
<?php
$angle1=90;
$angle2=15;
echo " угол 1 = $angle1 и угол 2 =$angle2 <br>";
if ($angle1>0 && $angle2>0 && ($angle1+$angle2)<180){
    echo "Треугольник сущесвует";
}else{
    echo "Он не является треугольником";
};
$angle3=180-($angle1+$angle2);
if ($angle1=90||$angle2=90||$angle3=90){
 echo ": Треугольник является прямоугольным";
}else{
    echo": Треугольник не прямогугольный";
}?>
<h2>Задание 3</h2>
<?php
$age=4;
echo "Возраст группы котов: $age <br>";
if ($age<=1){
    echo "Котята";
}elseif($age>1 && $age<=3){
    echo "Молодые коты";
}elseif($age>3 && $age<=7){
    echo "Взрослые коты";
}elseif($age>7){
    echo "Коты в возрасте";
}?>

<h2>Задание 4</h2>
<?php
$a=12;
$b=10;
$c=5;
echo "Стороны a b и c равны $a $b и $c <br>";
if ($a+$b>$c && $c+$b=$a && $a+$c=$b){
    echo "Треугольник с такими сторонами существует";
}else{
    echo "Такой треугольник не может сущесвтовать";
}?>  
<h2>Задание 5</h2>
<?php
$N=2000;
echo "Год: $N <br>";
if (($N%100!==0 && $N%4==0 )|| $N%400==0){
    echo "Год высокосный ";
}else{
    echo "Год не высокосный";
}?>
<h2>Задание 6</h2>
<?php
$A=10000;
$B=23400;
echo "$A + $B <br>";
if ($A+$B<=32767){
    echo "Сумма А и B" .($A+$B);
}else{
    echo "Произошло переполнение";
}?>
<h2>Задание 7</h2>
<?php
$A=12;
$B=10;
echo "Стороны прямоугольного отверстия: $A и $B <br>";
$x=10;
$y=6;
$z=7;
echo "Размеры кирпича: $x $y $z <br>";
if(($A>$x && $B>$y)||($A>$y && $A>$z)||($A>$z && $B>$y) ||($A>$y && $B>$x)||($A>$z && $B>$x)||($A>$x && $B>$z)){
    echo"Кирпич проходит через прямоугольное отверстие";
}else{
    echo"Кирпич не проходит через прямоугольное отверстие";
}?>

<h2>Задание 8</h2> 
<?php
$daynumber=301;
echo "День - $daynumber <br>";
$months=[
    1=>"Январь",2=>"Февраль",3=>"Март",4=>"Апрель",5=>"Май",6=>"Июнь",
    7=>"Июля",8=>"Августа",9=>"Сентябрь",10=>"Октябрь",11=>"Ноябрь",12=>"Декабрь"
    ];
$daymonth=[1=>31,2=>28,3=>31,4=>30,5=>31,6=>30,7=>31,8=>31,9=>30,10=>31,11=>30,12=>31,];
$m=1;
$currentday=$daynumber;
while($currentday>$daymonth[$m]){
    $currentday -= $daymonth[$m];
    $m++;
}
echo "$daynumber День - это $currentday " .$months[$m];
?>
<h2>Задание 9</h2>
<?php
$d=36;
$s=6;
$s1=4;
if($d%6===0 && $d%4==0){
    echo "Число $d делится на 4 и 6. Получаемые ответы при деления на 6 = ".($d/$s).",при делении на 4 = ".($d/$s1)."." ;
}else {
    echo "Число не делиться на 4 и 6";
} 
?>
<h2>Задание 10</h2>
<?php
$X=10;
$y=5;
$r=6;
echo "Координаты точки: ($X,$y) Радиус окружности = $r <br>";
if($x<=$r && $y<=$r){
    echo "Точка поподает в окружность с r = 6";
}else{
 echo "Точка не попадает в окружность с r = 6";
}
?>