<h1>Операции в PHP</h1>
<h2>Арифметические операции</h2>
<p>+ - * / ** %</p>
<?php
$a = 33 % 22;
echo $a;
?>
<h2>Инкримент и дикримент</h2>
<?php
$b = 2;
$c = ++$b;
echo "b = $b <br> c = $c";
?>
<h2>Строчные операции</h2>
<?php
$str1 = "Hello ";
$str2 = "PHP!";
$str3 = 'Я учусь на ' . 2 . ' курсе';
echo $str1 . $str2, '<br>', $str3;
?>
<h2>Операции сравнения</h2>
<p>< > <= >= == !=</p>
<?php
$s = 4 < 5;
$d = 4 == '4';
$e = 4 === '4';
echo $s, '<br>', $d, '<br>', $e;
?>
<h2>Логичексие операции</h2>
<p>Операция И (&& and) Операция ИЛИ (|| or) Операция НЕ (!)</p>
<?php
$p = true && false;
$p1 = true || false;
$p2 = 5 <= 7 && 4 == 5;
$p3 = !$p2;
echo "( $p) <br> $p1 <br> ( $p2) <br> $p3";
?>
<h2>Операции присваивания</h2>
<p> = </p>
<?php
$o = ($r = 5);
echo "$o <br> $r"
?>
<p> -= += *= /= **= %= .=</p>
<?php
$l = 42;
$l += 10;
$h = "Hello ";
$h .= "World";
echo "$l <br> $h";
?>
<h2>Приоритет операций (Поубыванию)</h2>
<p>**</p>
<p>++ --</p>
<p>!</p>
<p>* / %</p>
<p>+ -</p>
<p>< > <= >=</p>
<p>== != === !==</p>
<p>&&</p>
<p>||</p>
<p>= += -= ...</p>